{
  "architectures": ["AFMTextV7Wrapper"],
  "model_type": "llama",
  "vocab_size": 153600,
  "hidden_dim": 2048,
  "hidden_size": 2048,
  "num_layers": 56,
  "num_hidden_layers": 56,
  "num_kv_reuse_layers": 21,
  "num_heads": 16,
  "num_attention_heads": 16,
  "num_kv_heads": 2,
  "num_key_value_heads": 2,
  "hidden_dim_scale_factor": 3.25,
  "rope_theta": 500000.0
}
